{
  "backend/main.mo": "Motoko actor defining the cricket scoring backend with types for Teams, Players, Matches, Innings, Deliveries, and TournamentRules, plus persistent stores and ID counters for managing all entities.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs (router fixes, page rendering guards, actor/query hook fixes) to their affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "A JSON-formatted reference document summarizing the purpose and key fixes applied to each frontend source file across pages, hooks, components, and utilities.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for the design system's color tokens in both light and dark modes, plus base body and border styles.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, mounting the app into a root div and loading the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Configures the TanStack Router with all application routes (home, history, teams, setup, live scoring, scorecard, rules) under a root route that wraps the app in QueryClientProvider and Layout.",
  "frontend/src/components/BatsmanStatsPanel.tsx": "Displays batting statistics (runs, balls, fours, sixes, strike rate) for the striker and non-striker in a two-card panel during live scoring.",
  "frontend/src/components/BottomTabNavigation.tsx": "Fixed bottom navigation bar rendering four tabs (History, Teams, Setup, Rules) using TanStack Router Links with active state detection based on the current pathname.",
  "frontend/src/components/BowlerStatsPanel.tsx": "Displays current bowler statistics (overs, runs, wickets, economy, maidens) in a card panel, resolving the bowler's name from a players list.",
  "frontend/src/components/BulkPlayerUploadModal.tsx": "Multi-step modal for bulk-adding players to a team via pasted text or file upload, with validation (duplicates, length, spacing) and per-player status feedback.",
  "frontend/src/components/ConfigureTournamentRulesModal.tsx": "Modal dialog for viewing and editing tournament rules (overs, powerplay, penalties, etc.), fetching current rules from the backend and submitting updates.",
  "frontend/src/components/EndOfInningsModal.tsx": "Modal for selecting the opening striker, non-striker, and bowler at the start of the second innings before confirming to proceed.",
  "frontend/src/components/EndOfOverModal.tsx": "Modal for selecting the next bowler at the end of an over, excluding the current bowler from the available options.",
  "frontend/src/components/Layout.tsx": "Main app layout component providing a sticky header with logo, bottom tab navigation, a footer, and a content area rendered via React Router's Outlet.",
  "frontend/src/components/OverTimeline.tsx": "Displays the current over's ball-by-ball results as colored circles (wicket, wide, no-ball, runs) with empty slots for remaining balls.",
  "frontend/src/components/PlayingElevenSelector.tsx": "A React component that renders a scrollable checklist for selecting up to 11 players from a squad, showing a counter badge and disabling further selection once the limit is reached.",
  "frontend/src/components/ResetAllDataModal.tsx": "An alert dialog component that prompts the user to confirm deletion of all app data (teams, matches, rules), with a loading spinner state during the reset operation.",
  "frontend/src/components/ScoreDisplay.tsx": "Displays the live cricket scoreboard for a match, showing batting/bowling teams, current score, run rate, and target/runs-needed info for the second innings.",
  "frontend/src/components/WicketModal.tsx": "A dialog modal for recording a wicket event, allowing the user to select the dismissal type and the next incoming batsman from the available squad.",
  "frontend/src/data/cricketRules.ts": "Defines static cricket rule content organized into categories (Scoring, Extras, Dismissals) with titles and descriptions, along with TypeScript interfaces for the data shape.",
  "frontend/src/hooks/useActor.ts": "A custom React hook that creates and caches an ICP backend actor using the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useMatchState.ts": "Custom hook that manages live cricket match state (striker, non-striker, bowler, runs, wickets, overs) by combining backend match data with locally persisted player selections.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for fetching and mutating teams, players, matches, and deliveries via the backend actor, with cache invalidation on mutations.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind, imports Google Fonts (Inter and Rajdhani), defines light/dark CSS custom properties for the design system, and adds cricket-specific utility classes.",
  "frontend/src/lib/matchStore.ts": "localStorage utility module for persisting match metadata, match history, and live match state (striker/bowler IDs) since the backend lacks a getAllMatches endpoint.",
  "frontend/src/lib/matchUtils.ts": "Utility functions for cricket match calculations including formatting overs, computing run rates, generating ball/wicket labels, and computing per-batsman and per-bowler statistics from delivery records.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/src/pages/LiveScoring.tsx": "Live scoring page that loads match and team data, displays the current innings scorecard, and handles delivery recording with modals for wickets, end-of-over, and end-of-innings events.",
  "frontend/src/pages/MatchHistory.tsx": "Match history page that lists stored matches from local storage with options to refresh, reset all data, or start a new match, displaying each match as a card with status badges.",
  "frontend/src/pages/MatchSetup.tsx": "Multi-step match setup wizard that guides the user through selecting teams, choosing playing elevens, configuring match rules, and confirming before creating the match on the backend.",
  "frontend/src/pages/Rules.tsx": "Rules page with tabs for standard cricket rules and tournament-specific rules, displaying them in accordions and providing a modal to configure tournament rule settings.",
  "frontend/src/pages/Scorecard.tsx": "React page that displays a full cricket match scorecard, computing batting and bowling statistics from ball-by-ball delivery records and rendering them in innings-tabbed tables with loading/error states.",
  "frontend/src/pages/Teams.tsx": "React page for managing cricket teams, supporting listing, creating, and expanding teams to view/add players individually or via bulk upload modal.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, CSS-variable-based color tokens (including navy and orange palettes), border radii, box shadows, and keyframe animations.",
  "project_state.json": "JSON file tracking the overall project state (version 25) for an offline cricket scoring app, including architectural notes, known issues, and a list of existing implemented features."
}