{
  "backend/main.mo": "Motoko actor defining the cricket scoring backend with types for teams, players, matches, innings, deliveries, and tournament rules, plus stores and CRUD/game logic functions.",
  "feature_evidence.json": "Feature evidence report identifying a single high-confidence feature task: fixing the LiveScoring.tsx scoring regression for all delivery types without reintroducing the EndOfOverModal loop.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short summaries describing the purpose and recent changes of each component, page, hook, and utility in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes (colors, radius, chart, sidebar variables).",
  "frontend/index.html": "Minimal HTML shell for the React SPA, mounting the app into a #root div and loading the Vite/TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes and wraps the app in QueryClientProvider and a Layout shell.",
  "frontend/src/components/BatsmanStatsPanel.tsx": "Displays batting stats cards for the current striker and non-striker, showing runs, balls, fours, sixes, and strike rate with visual differentiation for the striker.",
  "frontend/src/components/BottomTabNavigation.tsx": "Fixed bottom navigation bar with four tabs (History, Teams, Setup, Rules) using TanStack Router Links with active state highlighting.",
  "frontend/src/components/BowlerStatsPanel.tsx": "Displays the current bowler's stats (overs, runs, wickets, economy, maidens) in a card, resolving the bowler's name from the players list.",
  "frontend/src/components/BulkPlayerUploadModal.tsx": "A multi-step modal dialog for bulk-uploading players to a team via pasted text or file input, with validation (duplicates, length, spacing) and a preview/result flow.",
  "frontend/src/components/ConfigureTournamentRulesModal.tsx": "A modal dialog for viewing and updating tournament rules (overs, teams, penalties, etc.), fetching current rules from the backend and submitting changes via a form.",
  "frontend/src/components/EndOfInningsModal.tsx": "A modal dialog shown at the end of an innings that lets the user select the opening striker, non-striker, and bowler to set up the next innings.",
  "frontend/src/components/EndOfOverModal.tsx": "A modal dialog shown at the end of each over that prompts the user to select the next bowler, excluding the current bowler.",
  "frontend/src/components/Layout.tsx": "The main app shell component that renders a sticky header with logo, bottom tab navigation, a footer, and a content area via React Router's Outlet or children.",
  "frontend/src/components/OverTimeline.tsx": "Displays a visual ball-by-ball timeline for the last three overs, color-coding each delivery by type (wicket, wide, no-ball, boundary, etc.).",
  "frontend/src/components/PlayingElevenSelector.tsx": "A scrollable checklist component for selecting up to 11 players from a squad, with visual feedback for selected, disabled, and complete states.",
  "frontend/src/components/QueryErrorState.tsx": "Renders a styled error alert for query failures, detecting Internet Computer canister errors to show user-friendly messages and an optional retry button.",
  "frontend/src/components/ResetAllDataModal.tsx": "Confirmation dialog that warns the user about permanently deleting all tournament data (teams, matches, rules) and provides Cancel/Delete actions with a loading state.",
  "frontend/src/components/ScoreDisplay.tsx": "Displays the current cricket match score card including runs, wickets, overs, innings indicator, and target/required-runs info for the second innings.",
  "frontend/src/components/WicketModal.tsx": "Modal dialog for recording a wicket dismissal, allowing selection of dismissal type and the next incoming batsman before confirming the delivery.",
  "frontend/src/data/cricketRules.ts": "Static data file defining categorized cricket rules (Scoring, Extras, Dismissals, etc.) as structured objects with titles and descriptive content strings.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor (authenticated or anonymous) via React Query, invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and login status states.",
  "frontend/src/hooks/useMatchState.ts": "A React hook that manages and persists cricket match state (striker, non-striker, bowler, innings, match result) to localStorage, exposing setters and helpers like swapBatsmen, startNextInnings, and endMatch.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating teams, players, and matches via the backend actor, including queries for getAllTeams, getMatch, and mutations for createMatch, addPlayer, and selectSquad.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS, and defines CSS custom properties for light/dark themes including navy and orange color palettes and cricket-specific utility classes.",
  "frontend/src/lib/matchStore.ts": "Provides localStorage-backed CRUD utilities for persisting match records, match metadata (teams, playing elevens, player IDs), and local match state, with BigInt serialization handling.",
  "frontend/src/lib/matchUtils.ts": "Utility functions for cricket scoring calculations including formatting overs, run rates, ball/wicket labels, and computing per-batsman and per-bowler statistics from ball-by-ball delivery records.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/LiveScoring.tsx": "Main live scoring page that manages real-time cricket match state including deliveries, batsman/bowler stats, innings transitions, and modals for wickets and end-of-over events. Persists state locally and syncs with the backend via hooks.",
  "frontend/src/pages/MatchHistory.tsx": "Displays a list of stored matches from local storage with status badges, and provides options to refresh, reset all data, or start a new match.",
  "frontend/src/pages/MatchSetup.tsx": "Multi-step wizard for setting up a new cricket match, covering team selection, playing eleven selection, match rules configuration, and confirmation before navigating to live scoring.",
  "frontend/src/pages/Rules.tsx": "Displays standard cricket rules and tournament-specific rules in a tabbed accordion layout, with a modal to configure tournament rules.",
  "frontend/src/pages/Scorecard.tsx": "Shows a detailed post-match or in-progress scorecard with batting and bowling statistics for both innings, computed from delivery data fetched via query hooks.",
  "frontend/src/pages/Teams.tsx": "React page component for managing cricket teams, supporting listing, adding teams, adding individual players, and bulk player uploads via dialogs and modals.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, CSS-variable-based color tokens (navy, orange, semantic colors), border radii, box shadows, and keyframe animations.",
  "project_state.json": "Project state metadata for a Cricket Scorer app, tracking version 3 with a known scoring regression bug in LiveScoring.tsx as the active fix request."
}