{
  "backend/main.mo": "Motoko actor defining the cricket scoring backend with types for teams, players, matches, innings, deliveries, and tournament rules, plus stores and auto-increment IDs for managing all entities.",
  "feature_evidence.json": "Feature evidence report listing two implemented features: bulk player upload on the Teams page and a full UI retheme to a blue/orange color scheme, with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short summaries describing each file's role, hook signatures, and theming details for build planning reference.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes (background, foreground, primary, accent, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML shell for the React app, mounting the root div and loading the main TypeScript module entry point.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all application routes (home, setup, match, scorecard, history, teams, rules) using Layout as the root route component.",
  "frontend/src/components/BatsmanStatsPanel.tsx": "Card component displaying live batting stats (runs, balls, fours, sixes, strike rate) for the current striker and non-striker batsmen.",
  "frontend/src/components/BottomTabNavigation.tsx": "Fixed bottom navigation bar with five tabs (Home, Teams, New Match, History, Rules) styled with a navy background and orange active-state indicators using inline oklch colors.",
  "frontend/src/components/BowlerStatsPanel.tsx": "Card component displaying the current bowler's live stats (overs, maidens, runs, wickets, economy) in a single styled row.",
  "frontend/src/components/BulkPlayerUploadModal.tsx": "A multi-step modal dialog for bulk-uploading players to a team via pasted text or CSV, with validation (duplicates, length, spaces, team limit) and a preview/result workflow.",
  "frontend/src/components/ConfigureTournamentRulesModal.tsx": "A modal dialog for viewing and editing all tournament rules (overs, teams, penalties, etc.), fetching current rules from the backend and submitting updates via a form.",
  "frontend/src/components/EndOfInningsModal.tsx": "A modal shown at the end of an innings that displays the innings score and, for the first innings, lets the user select the opening striker, non-striker, and bowler for the second innings.",
  "frontend/src/components/EndOfOverModal.tsx": "A modal shown at the end of each over that prompts the user to select the next bowler from eligible (under over-limit, different from current) bowling team players.",
  "frontend/src/components/Layout.tsx": "The root app layout component rendering a sticky header with branding, a main content outlet, bottom tab navigation, and a footer.",
  "frontend/src/components/OverTimeline.tsx": "Displays the ball-by-ball timeline for the current over as colored circles with labels, plus empty dashed slots for remaining balls.",
  "frontend/src/components/ScoreDisplay.tsx": "Renders the live scoreboard showing the current innings score, run rate, and (in the second innings) required run rate and runs needed to win.",
  "frontend/src/components/WicketModal.tsx": "A modal dialog component for recording a wicket dismissal, allowing selection of which batsman is out and the dismissal type (Bowled, Caught, LBW, etc.) before confirming.",
  "frontend/src/data/cricketRules.ts": "Static data file defining cricket rules organized by category (Scoring, Extras, Dismissals, etc.) with titles and descriptive content, plus a TypeScript interface for tournament rules.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider for ICP, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useMatchState.ts": "Custom hook that manages live match state including striker, non-striker, and bowler IDs (persisted to local storage), and computes derived stats like total runs, wickets, overs, and per-player statistics from delivery records.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for fetching and mutating backend data including teams, players, matches, deliveries, and tournament rules via the ICP actor.",
  "frontend/src/index.css": "Global CSS file that imports Inter and Rajdhani fonts, sets up Tailwind directives, and defines a blue/orange professional theme with CSS custom properties for both light and dark modes.",
  "frontend/src/lib/matchStore.ts": "localStorage utility module for persisting match metadata (teams, dates, finish status) and local match state (striker, non-striker, bowler) since the backend lacks a getAllMatches endpoint.",
  "frontend/src/lib/matchUtils.ts": "Pure utility functions for cricket scoring calculations including overs formatting, run rates, ball/wicket labels, and per-batsman and per-bowler stats aggregation from delivery records.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/LiveScoring.tsx": "Live match scoring page that handles delivery recording, wicket entry, end-of-over and end-of-innings modals, and displays real-time score, batsman, and bowler stats for the current match.",
  "frontend/src/pages/MatchHistory.tsx": "Match history page that lists locally stored matches with live score summaries fetched from the backend, supporting navigation to active matches and deletion of match records.",
  "frontend/src/pages/MatchSetup.tsx": "Match setup page allowing users to select two teams, configure overs and rules, record the toss result, and create a new match before navigating to the live scoring view.",
  "frontend/src/pages/Rules.tsx": "Displays a searchable, tabbed cricket rules reference page with collapsible categories for both standard cricket rules and configurable tournament rules, plus a modal to configure tournament rules.",
  "frontend/src/pages/Scorecard.tsx": "Renders a full match scorecard page with tabbed batting and bowling tables for both innings, computing player stats from ball-by-ball delivery records.",
  "frontend/src/pages/Teams.tsx": "Manages teams and players with expandable team cards, dialogs to add teams and individual players, and a bulk player upload modal.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom navy/orange color palettes, cricket-specific score colors, display fonts (Rajdhani/Inter), custom shadows, and accordion/slide animations.",
  "project_state.json": "Tracks the overall project state for an offline cricket scoring app, including version, architectural notes, known issues, and a list of existing implemented features."
}