{
  "backend/main.mo": "Motoko actor defining the cricket scoring backend with types for teams, players, matches, innings, deliveries, and tournament rules, plus CRUD operations and validation logic stored in in-memory maps.",
  "feature_evidence.json": "Feature evidence report documenting that graceful error boundary handling (with user-friendly messages and retry buttons) was added to LiveScoring, MatchSetup, Rules, Scorecard, and Teams pages.",
  "frontend-file-summaries.txt": "Auto-generated summaries of all frontend source files describing component prop corrections, query error handling, routing, store utilities, and modal implementations across the cricket scoring app.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for the design system's color tokens in both light and dark modes using OKLCH values.",
  "frontend/index.html": "Minimal HTML shell for the Cricket Scoring App that mounts the React app into a root div and loads the main TSX entry point as an ES module.",
  "frontend/src/App.tsx": "Root React app component that sets up TanStack Router with all application routes (history, teams, setup, live scoring, scorecard, rules) wrapped in QueryClientProvider and a shared Layout shell.",
  "frontend/src/components/BatsmanStatsPanel.tsx": "React component displaying batting statistics (runs, balls, fours, sixes, strike rate) for the striker and non-striker, with visual highlighting for the striker.",
  "frontend/src/components/BottomTabNavigation.tsx": "Fixed bottom navigation bar with four tabs (History, Teams, Setup, Rules) using TanStack Router Links with active state detection and accent indicator.",
  "frontend/src/components/BowlerStatsPanel.tsx": "React component displaying the current bowler's statistics (overs, runs, wickets, maidens, economy) looked up by player ID from a players array.",
  "frontend/src/components/BulkPlayerUploadModal.tsx": "A multi-step modal dialog for bulk-uploading players to a team via pasted text or file input, with validation (duplicates, length, spacing) and a preview/result flow.",
  "frontend/src/components/ConfigureTournamentRulesModal.tsx": "A modal dialog for viewing and editing tournament rules (overs, teams, penalties, etc.), converting between backend bigint types and form number values before saving.",
  "frontend/src/components/EndOfInningsModal.tsx": "A modal that appears at the end of an innings (or for opener selection) to let the user pick the striker, non-striker, and opening bowler for the next innings.",
  "frontend/src/components/EndOfOverModal.tsx": "A modal shown at the end of each over that prompts the user to select the next bowler, excluding the bowler who just bowled.",
  "frontend/src/components/Layout.tsx": "The main app shell component providing a sticky header with logo, a centered content area via Outlet or children, bottom tab navigation, and a footer.",
  "frontend/src/components/OverTimeline.tsx": "Displays a visual ball-by-ball timeline for the last three overs, grouping deliveries into overs with color-coded circles indicating runs, wickets, and extras.",
  "frontend/src/components/PlayingElevenSelector.tsx": "A component that renders a scrollable checklist of players for selecting a playing eleven, enforcing a configurable maximum selection limit with visual feedback.",
  "frontend/src/components/QueryErrorState.tsx": "Displays a user-friendly error alert for query failures, with special handling for Internet Computer canister errors and an optional retry button.",
  "frontend/src/components/ResetAllDataModal.tsx": "A confirmation dialog that warns the user about permanently deleting all app data (teams, matches, rules) and provides Cancel/Delete actions with a loading state.",
  "frontend/src/components/ScoreDisplay.tsx": "Renders the current match scorecard card showing runs, wickets, overs, innings indicator, and target/required runs for the second innings.",
  "frontend/src/components/WicketModal.tsx": "A dialog for recording a wicket dismissal, allowing the user to select the wicket type and the next incoming batsman before confirming.",
  "frontend/src/data/cricketRules.ts": "Defines static cricket rule content organized into categories (Scoring, Extras, Dismissals) along with TypeScript interfaces for rule data structures.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an Internet Computer backend actor (authenticated or anonymous) using TanStack Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useMatchState.ts": "A React hook that manages cricket match state (striker, non-striker, bowler, innings, match result) with localStorage persistence and helper actions like swapping batsmen and ending the match.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for all backend interactions including teams, players, matches, innings, and deliveries, wrapping actor calls with useQuery and useMutation.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, imports Google Fonts (Inter and Rajdhani), defines CSS custom properties for light/dark themes with navy and orange palettes, and adds cricket-specific utility classes.",
  "frontend/src/lib/matchStore.ts": "Utility module for persisting and retrieving cricket match data (stored matches, match metadata, and local match state) in localStorage, handling BigInt serialization/deserialization.",
  "frontend/src/lib/matchUtils.ts": "Utility functions for cricket match calculations including formatting overs, computing run rates, and deriving batsman/bowler statistics from ball-by-ball delivery records.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/LiveScoring.tsx": "Live scoring page that records ball-by-ball deliveries, manages batsman/bowler state, and handles modals for wickets, end of over, and end of innings.",
  "frontend/src/pages/MatchHistory.tsx": "Displays a list of stored matches with status badges, and provides options to refresh, reset all data, or start a new match.",
  "frontend/src/pages/MatchSetup.tsx": "Multi-step match setup wizard that lets users select teams, choose playing elevens, configure match rules, and then creates the match on the backend.",
  "frontend/src/pages/Rules.tsx": "Rules page with tabs for standard cricket rules and configurable tournament rules, displayed in an accordion layout with a modal for editing tournament settings.",
  "frontend/src/pages/Scorecard.tsx": "React page that displays a cricket match scorecard, computing and rendering batting and bowling statistics per innings from delivery data fetched via custom query hooks.",
  "frontend/src/pages/Teams.tsx": "React page for managing cricket teams, supporting listing, adding teams, adding individual players, and bulk player uploads, with loading/error states handled via query hooks.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, CSS-variable-based color tokens (including navy and orange palettes), border radii, box shadows, and keyframe animations.",
  "project_state.json": "Project state metadata describing a known IC0508 canister-stopped error on the getAllTeams endpoint, an existing graceful error boundary fix, and a pending request to ensure the backend Motoko actor compiles and deploys correctly."
}