{
  "kind": "build_request",
  "title": "Fix broken scoring in LiveScoring page",
  "projectName": "Cricket Scorer",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-2",
      "text": "Diagnose and fix the scoring regression in LiveScoring.tsx where recording deliveries (runs, extras, wickets) has stopped functioning correctly. Ensure that every valid delivery type — normal runs (0–6), wides, no-balls, byes, leg-byes, and wickets — is correctly recorded, updates the score display, advances the over/ball count, and persists both to localStorage and the backend. The fix must not reintroduce the EndOfOverModal infinite bowler-selection loop resolved in Version 20.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "scoring again is not working .. it was working fine earlier"
        ]
      },
      "acceptanceCriteria": [
        "Tapping any run value (0–6) on the scoring pad increments the score and ball count correctly.",
        "Wide and no-ball extras add the correct run penalty and do not advance the legal ball count.",
        "Wicket recording decrements the wicket count and triggers the WicketModal for batsman selection.",
        "The over count advances correctly after 6 legal deliveries and the EndOfOverModal appears exactly once.",
        "Score updates are immediately reflected in ScoreDisplay and BatsmanStatsPanel/BowlerStatsPanel.",
        "Match state is persisted to localStorage after each delivery.",
        "The EndOfOverModal bowler-selection loop from the Version 20 fix remains resolved.",
        "No console errors are thrown during normal scoring flow."
      ]
    }
  ],
  "constraints": [
    "Do not reintroduce the EndOfOverModal infinite bowler-selection loop that was fixed in Version 20.",
    "All Motoko logic must remain in the single backend/main.mo actor.",
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui."
  ],
  "nonGoals": [
    "Redesigning the scoring UI layout.",
    "Adding new delivery types or scoring rules.",
    "Changes to team or player management."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}