{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix broken page navigation and rendering after Version 11",
  "requirements": [
    {
      "id": "REQ-28",
      "summary": "Audit and fix the TanStack Router configuration in App.tsx to ensure all registered routes render their page components correctly when navigated to",
      "acceptanceCriteria": [
        "Navigating to the Teams tab renders the Teams page without a blank screen or crash",
        "Navigating to the Match Setup tab renders the MatchSetup page without a blank screen or crash",
        "Navigating to the History tab renders the MatchHistory page without a blank screen or crash",
        "Navigating to the Rules tab renders the Rules page without a blank screen or crash",
        "Navigating to the Home tab renders the default home/match-history page without a blank screen or crash",
        "All bottom tab navigation links resolve to the correct page components"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Review and fix the TanStack Router route tree configuration. Verify that all route definitions (Home/MatchHistory at '/', Teams at '/teams', MatchSetup at '/setup', LiveScoring at '/match/:matchId', Scorecard at '/scorecard/:matchId', Rules at '/rules') are correctly registered with proper lazy imports or component references. Ensure the router outlet in Layout will render the matched route's component. Check for any typos in route paths, missing component exports, incorrect lazy import syntax, or route tree nesting issues that would prevent page components from mounting when their route is active."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Audit all page-level components for runtime errors that prevent rendering, add proper loading and error guards for React Query results",
      "acceptanceCriteria": [
        "Each page shows a loading indicator while backend queries are in-flight",
        "Each page shows a meaningful error state if the backend query fails, rather than crashing",
        "No page throws an unhandled runtime error when its data is undefined or null on first render",
        "All page components have valid default exports",
        "No circular import chains exist among page or component files"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Teams.tsx",
          "operation": "modify",
          "description": "Add defensive checks around React Query results from useTeams and any other hooks. Ensure the component renders a loading spinner or skeleton while queries are pending. Add error boundary or error state UI if queries fail. Guard against accessing undefined/null data before the query succeeds. Verify the component has a valid default export."
        },
        {
          "path": "frontend/src/pages/MatchSetup.tsx",
          "operation": "modify",
          "description": "Add defensive checks around React Query results from useTeams and any other hooks used in the multi-step wizard. Ensure each step renders a loading state while data is being fetched. Add error states if queries fail. Guard against accessing undefined/null team or player data before queries complete. Verify the component has a valid default export."
        },
        {
          "path": "frontend/src/pages/MatchHistory.tsx",
          "operation": "modify",
          "description": "Review how locally stored match history is accessed and rendered. Add loading states if any backend queries (e.g., for team details) are used. Add error handling for failed queries. Guard against undefined/null data access. Verify the component has a valid default export."
        },
        {
          "path": "frontend/src/pages/LiveScoring.tsx",
          "operation": "modify",
          "description": "Add defensive checks around React Query results from useMatch and other hooks. Ensure the component renders a loading state while the match data is being fetched. Add error states if queries fail. Guard against accessing undefined/null match, team, or player data before queries complete. Verify the component has a valid default export."
        },
        {
          "path": "frontend/src/pages/Scorecard.tsx",
          "operation": "modify",
          "description": "Add defensive checks around React Query results from useMatch and other hooks. Ensure the component renders a loading state while match data is being fetched. Add error states if queries fail. Guard against accessing undefined/null match or delivery data before queries complete. Verify the component has a valid default export."
        },
        {
          "path": "frontend/src/pages/Rules.tsx",
          "operation": "modify",
          "description": "Add defensive checks around React Query results from useTournamentRules and any other hooks. Ensure the component renders a loading state while rules are being fetched. Add error states if queries fail. Guard against accessing undefined/null tournament rules before queries complete. Verify the component has a valid default export."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Audit useActor and useQueries hooks to ensure the backend actor is initialized correctly and queries handle uninitialized actor state gracefully",
      "acceptanceCriteria": [
        "Pages that depend on backend queries do not crash when the actor is not yet initialized",
        "React Query hooks return loading or idle state rather than throwing when the actor is undefined",
        "Once the actor becomes available, queries re-fetch and pages populate with data automatically"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review all React Query hook definitions (useTeams, useMatch, useTournamentRules, etc.) to ensure they use the 'enabled' option to prevent queries from running when the actor is undefined or null. For example, set enabled: !!actor in the query options. Verify that mutations also check for actor existence before attempting to call backend methods. This prevents runtime errors from propagating up to page components when the actor is not yet initialized."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Audit Layout and BottomTabNavigation components to ensure the router outlet renders child page content correctly and navigation links use correct hrefs",
      "acceptanceCriteria": [
        "The main content area of the Layout renders the active route's page component",
        "Bottom tab navigation links navigate to the correct routes without a full page reload",
        "No page content is hidden by an incorrect conditional in Layout or BottomTabNavigation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Verify that the TanStack Router Outlet component is correctly placed in the main content area and is not wrapped in any conditional logic that would prevent it from rendering. Ensure the Outlet is always visible and that the Layout's structure does not inadvertently hide or replace the outlet with an empty fragment or null. Confirm that the Layout passes through all child routes without interference."
        },
        {
          "path": "frontend/src/components/BottomTabNavigation.tsx",
          "operation": "modify",
          "description": "Review each navigation link to ensure it uses the correct TanStack Router Link component with the correct 'to' prop values matching the route paths defined in App.tsx ('/' for Home/History, '/teams' for Teams, '/setup' for Match Setup, '/rules' for Rules). Verify that the active route detection logic correctly highlights the active tab. Ensure no typos or mismatched paths exist that would cause navigation to fail or route to the wrong page."
        }
      ]
    }
  ]
}