{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix broken scoring in LiveScoring page",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Diagnose and fix the scoring regression in LiveScoring.tsx where recording deliveries (runs, extras, wickets) has stopped functioning correctly. Restore all delivery type handling (normal runs 0–6, wides, no-balls, byes, leg-byes, wickets) to correctly record, update score display, advance over/ball count, and persist to localStorage and backend without reintroducing the EndOfOverModal infinite bowler-selection loop.",
      "acceptanceCriteria": [
        "Tapping any run value (0–6) on the scoring pad increments the score and ball count correctly.",
        "Wide and no-ball extras add the correct run penalty and do not advance the legal ball count.",
        "Wicket recording decrements the wicket count and triggers the WicketModal for batsman selection.",
        "The over count advances correctly after 6 legal deliveries and the EndOfOverModal appears exactly once.",
        "Score updates are immediately reflected in ScoreDisplay and BatsmanStatsPanel/BowlerStatsPanel.",
        "Match state is persisted to localStorage after each delivery.",
        "The EndOfOverModal bowler-selection loop from the Version 20 fix remains resolved.",
        "No console errors are thrown during normal scoring flow."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LiveScoring.tsx",
          "operation": "modify",
          "description": "Diagnose and repair the broken scoring logic in the delivery recording flow. Identify the root cause preventing handleRecordDelivery from executing (likely event handler disconnection, conditional rendering issue, or state mutation bug). Restore functionality for all delivery types: normal runs (0–6), wides, no-balls, byes, leg-byes, and wickets. Ensure each delivery type correctly updates the deliveries array, triggers score/ball/over count updates, persists to localStorage via matchStore, calls the backend recordDelivery mutation, and updates React state to refresh ScoreDisplay, BatsmanStatsPanel, and BowlerStatsPanel. Verify that the over advancement logic triggers EndOfOverModal exactly once after 6 legal deliveries without reintroducing the infinite bowler-selection loop. Ensure WicketModal appears on wicket recording. Add defensive null checks and console logging for debugging if needed. Test all delivery paths to confirm acceptance criteria are met."
        }
      ]
    }
  ]
}