{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Project using Internet Computer (ICP) canisters. Currently experiencing a canister stopped error (IC0508) when calling getAllTeams on canister rde4o-bqaaa-aaaaj-a3oja-cai.",
  "architectural_notes": [
    "Uses Internet Computer (ICP) canister architecture; canister ID rde4o-bqaaa-aaaaj-a3oja-cai hosts getAllTeams method"
  ],
  "known_issues": [
    "Canister rde4o-bqaaa-aaaaj-a3oja-cai is stopped, causing IC0508 rejection errors on getAllTeams calls ('Failed to load teams')"
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-add-a-graceful-error-boundary-in-the-teams-page-and-any-other-page-that-calls-backend-queries-so-that-when-the-backend-canister-returns-a-rejection-error-e-g-ic0508-canister-is-stopped-the-ui-displays-a-user-friendly-error-message-unable-to-connect-to-the-backend-please-try-again-later-instead-of-the-raw-rejection-text-and-offers-a-retry-button-that-re-triggers-the-query",
      "title": "Add a graceful error boundary in the Teams page (and any other page that calls backend queries) so that when the backend canister returns a rejection error (e.g., IC0508 'canister is stopped'), the UI displays a user-friendly error message ('Unable to connect to the backend. Please try again later.') instead of the raw rejection text, and offers a retry button that re-triggers the query.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-2",
      "summary": "Ensure the backend Motoko actor in backend/main.mo compiles and is deployable without errors so the canister can be started and resume handling calls such as getAllTeams. Review the actor for any syntax errors, invalid stable variable declarations, or upgrade traps that could cause the canister to remain in a stopped state.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Fix canister stopped error causing getAllTeams failure",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}